Core/src/Documents/РС_ЭлектроннаяНакладная/РС_ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РС_ЭлектроннаяНакладная</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияУдостоверение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодительНеРезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получил</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <types>CatalogRef.Сотрудники</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_ТН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТранспортировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиТН</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.РС_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийТН</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АсинхроннаяТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТН</name>
    <type>
      <types>EnumRef.РС_ТипыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплатыТранспортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругойТранспорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладнаяДистрибюций</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикТранспортировкиТН</name>
    <type>
      <types>EnumRef.ПлательщикТранспортировкиТН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеЗапасов</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ПеремещениеВА</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДляРС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имущество</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоПодарок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыЭлНакладных</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UNIT_TXT</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PRICE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>A_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VAT_TYPE</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY_EXT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>STATUS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШапкаRS</name>
    <attributes>
      <name>ИмяПараметраRS</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметраRS</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_ТипыТН/РС_ТипыТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ТипыТН</name>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
    <comment>კოდი 1</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияСТранспортировкой</name>
    <comment>კოდი 2</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияБезТранспортировки</name>
    <comment>კოდი 3</comment>
  </enumValues>
  <enumValues>
    <name>Дистрибуция</name>
    <comment>კოდი 4</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>კოდი 5</comment>
  </enumValues>
  <enumValues>
    <name>ПодчиненнаяТН</name>
    <comment>კოდი 6</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/РС_ВидыТранспортировки/РС_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РС_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
    <comment>(კოდი 1)</comment>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
    <comment>(კოდი 2)</comment>
  </enumValues>
  <enumValues>
    <name>Авиационная</name>
    <comment>(კოდი 3)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(კოდი 4)</comment>
  </enumValues>
  <enumValues>
    <name>Автомобильная_Заграничная</name>
    <comment>(კოდი 6)</comment>
  </enumValues>
  <enumValues>
    <name>Перегрузчик_Автомобильная</name>
    <comment>(კოდი 7)</comment>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СоответствияНоменклатуры/СоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоответствияНоменклатуры</name>
  <enumValues>
    <name>ПоШтрихкоду</name>
  </enumValues>
  <enumValues>
    <name>ПоАртикулу</name>
  </enumValues>
  <enumValues>
    <name>ПоКоду</name>
  </enumValues>
  <enumValues>
    <name>ПоХарактеристике</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ПлательщикТранспортировкиТН/ПлательщикТранспортировкиТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлательщикТранспортировкиТН</name>
  <enumValues>
    <name>Продавец</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/РС_ЭлектроннаяНакладная/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("ДокументыОснования") Тогда
			Для Каждого ДокументОснование Из ДанныеЗаполнения.ДокументыОснования Цикл
				НоваяСтрока = ДокументыОснования.Добавить();
				НоваяСтрока.ДокументОснование = ДокументОснование;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли  Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))Тогда 
		ЗаполнитьДанныеДляОбмена(ДанныеЗаполнения);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отпустил) Тогда
		Отпустил = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Получил) Тогда
		Получил = "";
	КонецЕсли;
	
	ДругойТранспорт = Константы.ТипТранспортировкиДрогое.Получить();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляОбмена(СсылкаНаДокумент)
	Дата = ТекущаяДата();
	ИспользоватьАдресИзДоговораДляТТН = Константы.ОПТИМУС_ИспользоватьАдресИзДоговораДляТТН.Получить();
		
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиница.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= ?((СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветхранения Или
									СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение ИЛИ СсылкаНаДокумент.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку)  
									,Перечисления.РС_ТипыТН.ВнутреннееПеремещение, ?(МобильныйСклад, Перечисления.РС_ТипыТН.ПодчиненнаяТН, Перечисления.РС_ТипыТН.РеализацияСТранспортировкой));
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МобильныйСклад = СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв.МобильныйСклад;//Перем
		Договор = СсылкаНаДокумент.Договор;//Перем
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		
		
		ТипТН 					= Перечисления.РС_ТипыТН.РеализацияСТранспортировкой;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель   		= СсылкаНаДокумент.Организация;
		АдресОтправки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаРезерв, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ГрузоПолучатель         = СсылкаНаДокумент.Контрагент;
		АдресДоставки 			= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);
		Если НЕ МобильныйСклад Тогда
			ТранспортноеСредство 	= Договор.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= Договор.Водитель;
			НомерУдостоверения   	= Водитель.ИНН;
		КонецЕсли;
		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;			
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		Договор = СсылкаНаДокумент.Договор;//перем
		
		АдресПоДоговору = СсылкаНаДокумент.Договор.Адрес;
		АдресКонтрагента = УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.Контрагент, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);

		
		ТипТН 					= Перечисления.РС_ТипыТН.ВозвратОтПокупателя;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= СсылкаНаДокумент.Контрагент;
		АдресОтправки	 		= ?(ИспользоватьАдресИзДоговораДляТТН, АдресПоДоговору,АдресКонтрагента);		
		ГрузоПолучатель 		= СсылкаНаДокумент.Организация;
		АдресДоставки   		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);
		ТранспортноеСредство 	= Договор.ТранспортноеСредство;
		ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;		
		Водитель			 	= Договор.Водитель;
		НомерУдостоверения   	= Водитель.ИНН;
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;

	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ФактАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы;		
		
		Если СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.МобильныйСклад Тогда
			ТипТН 					= Перечисления.РС_ТипыТН.Дистрибуция;
			ТранспортноеСредство 	= СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель.ТранспортноеСредство;
			ГосНомерАвтомобиля	 	= ТранспортноеСредство.Код;
			Водитель			 	= ТранспортноеСредство.ОсновнойВодитель;
			НомерУдостоверения   	= Водитель.ИНН;
		Иначе
			ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		КонецЕсли;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиница,				ФактАдрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= УправлениеНебольшойФирмойСервер.ПолучитьКонтактнуюИнформацию(СсылкаНаДокумент.СтруктурнаяЕдиницаПолучатель,	ФактАдрес);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		//ВидЦены				= УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ВидыЦен", "Оптовая");
		
		//ТранспортноеСредство = СсылкаНаДокумент.Договор.ТранспортноеСредство;
		//Водитель			 = СсылкаНаДокумент.Договор.Водитель;
		//НомерУдостоверения   = Водитель.ИНН;
		//ГосНомерАвтомобиля	 = ТранспортноеСредство.Код;
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеВА") Тогда
		
		ТипТН 					= Перечисления.РС_ТипыТН.ВнутреннееПеремещение;
		ВидТранспортировки 		= Перечисления.РС_ВидыТранспортировки.Автомобильная;
		ГрузоОтправитель 		= Организация;
		АдресОтправки	 		= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].Адрес);
		ГрузоПолучатель 		= Организация;
		АдресДоставки 			= ?(СсылкаНаДокумент.ВнеоборотныеАктивы.Количество() = 0, "", СсылкаНаДокумент.ВнеоборотныеАктивы[0].АдресПолучатель);		
		//Перевозчик			= СсылкаНаДокумент.Организация;
		Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ПеренестиКомментарийВДокументЭлектроннаяНакладная") Тогда
			КомментарийТН			= СсылкаНаДокумент.Комментарий;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ()

Функция СформироватьТаблицуЭлНакладных() Экспорт 
	
	Организация_СоответствиеНоменклатур = Организация.СоответствиеНоменклатур;
	ВнутреннееПеремещение				= (ТипТН = Перечисления.РС_ТипыТН.ВнутреннееПеремещение);
	ПредставлениеНоменклатуры			= ?(Организация.ОтправитьПолноеНаименованиеНоменклатуры, "НаименованиеПолное", "Наименование");
	ТоварыЭлНакладных.Очистить();

	НоменклатураИмущество = "Номенклатура";
	Если ДокументыОснования.Количество() = 0 Тогда
		ЭтаПеремещениеВА = Ложь;
	Иначе
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.ПеремещениеВА") Тогда
			ЭтаПеремещениеВА = Истина;
			НоменклатураИмущество = "Имущество"
		Иначе
			ЭтаПеремещениеВА = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
	Для каждого СтрТаб Из Товары  Цикл
		СтрЭлНТаб = ТоварыЭлНакладных.Добавить();
		
		Если Не ЗначениеЗаполнено(СтрТаб[НоменклатураИмущество]) Тогда 
			Продолжить;
		КонецЕсли;
		//("GOODS"); //GOODS

		СтрЭлНТаб.ID       = 0;//СтрТаб.НомерСтроки-1 Паганини
		Если ЭтаПеремещениеВА Тогда
			СтрЭлНТаб.W_NAME   = Строка(СтрТаб.Имущество);
			СтрЭлНТаб.BAR_CODE = СтрТаб.Имущество.Код;
		Иначе
			СтрЭлНТаб.W_NAME   = ПредставлениеНоменклатуры(СтрТаб.Номенклатура[ПредставлениеНоменклатуры],СтрТаб.Характеристика,СтрТаб.Партия);
			Если Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда
				СтрЭлНТаб.BAR_CODE = СтрТаб.Номенклатура.Артикул;
			ИначеЕсли Организация_СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоШтрихкоду Тогда
				СтрЭлНТаб.BAR_CODE = ПолучитьКодШтрихКода(СтрТаб);
			ИначеЕсли Организация.СоответствиеНоменклатур = Перечисления.СоответствияНоменклатуры.ПоХарактеристике Тогда
				СтрЭлНТаб.BAR_CODE = ПолучитьКодХарактеристики(СтрТаб);        
			Иначе
				СтрЭлНТаб.BAR_CODE = СтрТаб.Номенклатура.Код;
			КонецЕсли;
		КонецЕсли;
		
		СтрЭлНТаб.UNIT_ID  = СтрТаб.ЕдиницаИзмерения.КодДляНалоговой;
		СтрЭлНТаб.UNIT_TXT = СтрТаб.ЕдиницаИзмерения.Наименование;
		СтрЭлНТаб.QUANTITY = СтрТаб.Количество;
		СтрЭлНТаб.STATUS   = "1";		
		Если ВнутреннееПеремещение Тогда
			СтрЭлНТаб.PRICE	   = 0;
			СтрЭлНТаб.AMOUNT   = 0;
		Иначе
			СтрЭлНТаб.PRICE	   = СтрТаб.Цена;
			СтрЭлНТаб.AMOUNT   = СтрТаб.Сумма;
		КонецЕсли;
		
		Если СтрТаб.ЭтоПодарок Тогда
			СтрЭлНТаб.AMOUNT   = 0;
		КонецЕсли;	
			
		
		СтрЭлНТаб.A_ID     = 0;//Акциз		
		Если ВнутреннееПеремещение Тогда
			СтрТаб.СтавкаНДС = СтрТаб.Номенклатура.СтавкаНДС;
		КонецЕсли;
		Если СтрТаб.СтавкаНДС.НеОблагается Тогда
			СтрЭлНТаб.VAT_TYPE = 2;
		ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 0 Тогда
			СтрЭлНТаб.VAT_TYPE = 1;
		ИначеЕсли СтрТаб.СтавкаНДС.Ставка = 18 Тогда
			СтрЭлНТаб.VAT_TYPE = 0;
		КонецЕсли;
		//СтрЭлНТаб.QUANTITY_EXT =  СтрТаб.Количество;
		
	КонецЦикла;
	

КонецФункции

Функция СформироватьТаблицуШапкаRS() Экспорт 
	
	TRANS_ID = 0;
	TRANS_TXT = "";
	документы.РС_ЭлектроннаяНакладная.ПолучитьВидТранспортировкиЭл(ТипТН, ВидТранспортировки, Прицеп, ДругойТранспорт, TRANS_ID, TRANS_TXT);
	СтатусыОперацииТН = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусОперацииТН();
	
	СтрукПар = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИнициализацияОтправкиТН(Новый Структура, Организация);
	Если ТипЗнч(СтрукПар) = Тип("Строка") Тогда 
		Возврат СтрукПар;
	КонецЕсли;
	seller_un_id = СтрукПар.un_id;

	ШапкаRS.Очистить();
	
	//ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = ID_ТН; 
	
	//STATUS
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "STATUS"; 
	СтрШапкаRS.ЗначениеПараметраRS =?(ЗначениеЗаполнено(СтатусТН),СтатусыОперацииТН[СтатусТН],0); 

	//TYPE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TYPE"; 
	СтрШапкаRS.ЗначениеПараметраRS = документы.РС_ЭлектроннаяНакладная.ОпределитьТипТН(ТипТН); 
	
	//ACTIVATE_DATE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "ACTIVATE_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ДатаНачалаТранспортировки; 
	
	//+++ Дмгг
	ГрузополучательОтправки = ГрузоПолучатель; 
	Если НЕ ЗначениеЗаполнено(ГрузоПолучатель) Тогда 
		Если ДокументыОснования.Количество() > 0 Тогда 
			Для Каждого Строк Из ДокументыОснования Цикл 
				Если ЗначениеЗаполнено(Строк.ДокументОснование) Тогда 
					ГрузополучательОтправки = Строк.ДокументОснование.Контрагент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ГрузоОтправительлОтправки = ГрузоОтправитель; 
	Если НЕ ЗначениеЗаполнено(ГрузоОтправитель) Тогда 
		Если ДокументыОснования.Количество() > 0 Тогда 
			Для Каждого Строк Из ДокументыОснования Цикл 
				Если ЗначениеЗаполнено(Строк.ДокументОснование) Тогда 
					ГрузоОтправительлОтправки = Строк.ДокументОснование.Контрагент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//--- Дмгг
	
	//BUYER
	Если ТипТН =  Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда 
		//BUYER_TIN
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "BUYER_TIN"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), СокрЛП(ГрузоОтправитель.ИНН), ""); //+++ Дмгг 
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправительлОтправки), СокрЛП(ГрузоОтправительлОтправки.ИНН), ""); //+++ Дмгг
		
		//CHEK_BUYER_TIN
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "CHEK_BUYER_TIN"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), ?(ГрузоОтправитель.ЯвляетсяНеРезидентом,0,1), 0); //+++ Дмгг 
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправительлОтправки), ?(ГрузоОтправительлОтправки.ЯвляетсяНеРезидентом,0,1), 0); //+++ Дмгг
		
		//BUYER_NAME
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "BUYER_NAME"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправитель), ГрузоОтправитель.Наименование, ""); //+++ Дмгг
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузоОтправительлОтправки), ГрузоОтправительлОтправки.Наименование, ""); //+++ Дмгг
	Иначе 
		
		//BUYER_TIN
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "BUYER_TIN"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), СокрЛП(Грузополучатель.ИНН), ""); //+++ Дмгг
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузополучательОтправки), СокрЛП(ГрузополучательОтправки.ИНН), ""); //+++ Дмгг
		
		//CHEK_BUYER_TIN
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "CHEK_BUYER_TIN"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), ?(Грузополучатель.ЯвляетсяНеРезидентом,0,1), 0);//+++ Дмгг 
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузополучательОтправки), ?(ГрузополучательОтправки.ЯвляетсяНеРезидентом,0,1), 0);//+++ Дмгг
		
		//BUYER_NAME
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS = "BUYER_NAME"; 
		//СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(Грузополучатель), Грузополучатель.Наименование, ""); //+++ Дмгг
		СтрШапкаRS.ЗначениеПараметраRS = ?(ЗначениеЗаполнено(ГрузополучательОтправки), ГрузополучательОтправки.Наименование, ""); //+++ Дмгг
	КонецЕсли;
	
	//START_ADDRESS
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "START_ADDRESS"; 
	СтрШапкаRS.ЗначениеПараметраRS =  АдресОтправки; 
	
	//END_ADDRESS
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "END_ADDRESS"; 
	СтрШапкаRS.ЗначениеПараметраRS = АдресДоставки; 
	
	//DRIVER_TIN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "DRIVER_TIN"; 
	СтрШапкаRS.ЗначениеПараметраRS = СокрЛП(НомерУдостоверения); 
	
	//CHEK_DRIVER_TIN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "CHEK_DRIVER_TIN"; 
	СтрШапкаRS.ЗначениеПараметраRS = ?(Водитель.ЯвляетсяНеРезидентом,0,1); 
	
	//DRIVER_NAME
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "DRIVER_NAME"; 
	СтрШапкаRS.ЗначениеПараметраRS = Водитель.Наименование;  
	
	//RECEPTION_INFO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "RECEPTION_INFO"; 
	СтрШапкаRS.ЗначениеПараметраRS = Строка(Отпустил); 
	
	//RECEIVER_INFO
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "RECEIVER_INFO"; 
	СтрШапкаRS.ЗначениеПараметраRS = Строка(Получил); 
	
	//DELIVERY_DATE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "DELIVERY_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ДатаДоставкиТН;
	
	//SELER_UN_ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "SELER_UN_ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = seller_un_id; 
	
	//CAR_NUMBER
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "CAR_NUMBER"; 
	СтрШапкаRS.ЗначениеПараметраRS = ГосНомерАвтомобиля; 
	
	//BEGIN_DATE
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "BEGIN_DATE"; 
	СтрШапкаRS.ЗначениеПараметраRS = ДатаНачалаТранспортировки; 
	
	//TRANS_ID
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_ID"; 
	СтрШапкаRS.ЗначениеПараметраRS = TRANS_ID;
	
	//TRANSPORTER_TIN
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANSPORTER_TIN";
	Если TRANS_ID = 7 Тогда
		Если ЗначениеЗаполнено(Перевозчик) Тогда
			СтрШапкаRS.ЗначениеПараметраRS = Перевозчик.ИНН;
		Иначе
		    СтрШапкаRS.ЗначениеПараметраRS = "";
		КонецЕсли;
	Иначе
		СтрШапкаRS.ЗначениеПараметраRS = "";
	КонецЕсли;
	
	//TRANS_TXT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANS_TXT"; 
	СтрШапкаRS.ЗначениеПараметраRS = TRANS_TXT; 
	
	//COMMENT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "COMMENT"; 
	СтрШапкаRS.ЗначениеПараметраRS = КомментарийТН; 
	
	//PAR_ID
	//Паганини_
	Если ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН Тогда
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS 		= "PAR_ID"; 
		СтрШапкаRS.ЗначениеПараметраRS 	= НакладнаяДистрибюций.IDTТН;
	Иначе//_Паганини
		СтрШапкаRS = ШапкаRS.Добавить();
		СтрШапкаRS.ИмяПараметраRS 		= "PAR_ID"; 
		СтрШапкаRS.ЗначениеПараметраRS 	= "";
	КонецЕсли;//Паганини
	
	Если ТипТН = Перечисления.РС_ТипыТН.РеализацияСТранспортировкой ИЛИ ТипТН = Перечисления.РС_ТипыТН.ВозвратОтПокупателя Тогда
		УказыватьЗатратуТранспортировки = ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная ИЛИ
										  ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Автомобильная_Заграничная ИЛИ
										  ВидТранспортировки = Перечисления.РС_ВидыТранспортировки.Перегрузчик_Автомобильная;
	Иначе
		УказыватьЗатратуТранспортировки = Ложь;
	КонецЕсли;
	//TRANSPORT_COAST
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRANSPORT_COAST"; 
	СтрШапкаRS.ЗначениеПараметраRS = ?(УказыватьЗатратуТранспортировки, СуммаОплатыТранспортировки, 0);
	
	//TRAN_COST_PAYER
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "TRAN_COST_PAYER"; 
	СтрШапкаRS.ЗначениеПараметраRS = ?(УказыватьЗатратуТранспортировки, ?(ПлательщикТранспортировкиТН = Перечисления.ПлательщикТранспортировкиТН.Покупатель, 1, 2), 2);//?(ТранспортировкаЗаСчетПокупателя,1,2) 
	
	//Паганини
	//FULL_AMOUNT
	СтрШапкаRS = ШапкаRS.Добавить();
	СтрШапкаRS.ИмяПараметраRS = "FULL_AMOUNT"; 
	СтрШапкаRS.ЗначениеПараметраRS = Товары.Итог("Сумма");
	
КонецФункции

//Возвращает строковое представление номенклатуры с характеристикой для отображения в сообщениях
//Параметры
// 		НоменклатураПредставление - строковое предствление номенклатуры или ссылка на элемент справочника "Номенклатура"
// 		ХарактеристикаПредставление - строковое предствление характеристики или ссылка на элемент справочника "Номенклатура"
Функция ПредставлениеНоменклатуры(Номенклатура, Характеристика, Серия) Экспорт

	СтрПредставление = СокрЛП(Номенклатура);

	Если ЗначениеЗаполнено(Характеристика)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Характеристика.Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Серия.Наименование);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	ID_ТН 		= 0;
	СтатусТН 	= Неопределено;
	НомерТН  	= "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+++ Дмгг
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ГрузоПолучатель) Тогда 
		Если ДокументыОснования.Количество() > 0 Тогда 
			Для Каждого Строк Из ДокументыОснования Цикл 
				Если ЗначениеЗаполнено(Строк.ДокументОснование) Тогда 
					ЭтотОбъект.ГрузоПолучатель = Строк.ДокументОснование.Контрагент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//--- Дмгг
	
	Если ДокументыОснования.Количество() > 0 Тогда
		ЗаписыватьДокумент = Ложь;
		Если НЕ ID_ТН = Ссылка.ID_ТН Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если НЕ НомерТН = Ссылка.НомерТН Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если ЗаписыватьДокумент Тогда
			ДокументОбъект = ДокументыОснования[0].ДокументОснование.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.НомерТТН = НомерТН;
			ДокументОбъект.IDTТН	= Формат(ID_ТН, "ЧН=' '; ЧГ=0");
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	Если НЕ ТипТН = Перечисления.РС_ТипыТН.ПодчиненнаяТН Тогда
		НакладнаяДистрибюций = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДокументыОснования.Количество() > 0 Тогда
		Если ТипЗнч(ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.ПеремещениеВА") Тогда
			ПроверяемыеРеквизиты.Добавить("Товары.Имущество");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Товары.Номенклатура");
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

//ДД
Функция ПолучитьКодХарактеристики(Стр)
	
	Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
		Возврат Стр.Характеристика.Код;
	Иначе
		Возврат Стр.Номенклатура.Код;
	КонецЕсли;	
	
КонецФункции

//ДД
Функция ПолучитьКодШтрихКода(Стр)
	
	Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ШтрихкодыНоменклатуры.Штрихкод
		               |ИЗ
		               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		               |ГДЕ
		               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		               |	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика";
		
	    Запрос.УстановитьПараметр("Номенклатура",Стр.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",Стр.Характеристика);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Штрихкод;
		Иначе
			Возврат "";
		КонецЕсли;	
				
	Иначе
		Возврат Стр.Номенклатура.ОсновнойШтрихКод;
	КонецЕсли;	
	
КонецФункции
